import { createAction, handleActions } from 'redux-actions';
import { Map, List } from 'immutable';

const initialState = {
    postList: List([
        Map({
            type: 'music',
            title: "오마이갓 댓츠 호러블",
            postedOn: new Date(2014, 2, 11),
            content: "<p>모든 국민은 보건에 관하여 국가의 보호를 받는다. 사법권은 법관으로 구성된 법원에 속한다. 대통령의 선거에 관한 사항은 법률로 정한다. 대법원장의 임기는 6년으로 하며, 중임할 수 없다. 대한민국은 민주공화국이다. 국회는 법률에 저촉되지 아니하는 범위안에서 의사와 내부규율에 관한 규칙을 제정할 수 있다. 국무총리는 국무위원의 해임을 대통령에게 건의할 수 있다. 광물 기타 중요한 지하자원·수산자원·수력과 경제상 이용할 수 있는 자연력은 법률이 정하는 바에 의하여 일정한 기간 그 채취·개발 또는 이용을 특허할 수 있다. 국회는 의장 1인과 부의장 2인을 선출한다. 국회는 헌법개정안이 공고된 날로부터 60일 이내에 의결하여야 하며, 국회의 의결은 재적의원 3분의 2 이상의 찬성을 얻어야 한다.</p><p>법률은 특별한 규정이 없는 한 공포한 날로부터 20일을 경과함으로써 효력을 발생한다. 국회의원과 정부는 법률안을 제출할 수 있다. 모든 국민은 언론·출판의 자유와 집회·결사의 자유를 가진다. 예비비는 총액으로 국회의 의결을 얻어야 한다. 예비비의 지출은 차기국회의 승인을 얻어야 한다. 대법원은 법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에 관한 규칙을 제정할 수 있다. 국무위원은 국정에 관하여 대통령을 보좌하며, 국무회의의 구성원으로서 국정을 심의한다. 대한민국은 통일을 지향하며, 자유민주적 기본질서에 입각한 평화적 통일 정책을 수립하고 이를 추진한다.</p><p>모든 국민은 법률이 정하는 바에 의하여 공무담임권을 가진다. 모든 국민은 헌법과 법률이 정한 법관에 의하여 법률에 의한 재판을 받을 권리를 가진다. 국토와 자원은 국가의 보호를 받으며, 국가는 그 균형있는 개발과 이용을 위하여 필요한 계획을 수립한다. 재의의 요구가 있을 때에는 국회는 재의에 붙이고, 재적의원과반수의 출석과 출석의원 3분의 2 이상의 찬성으로 전과 같은 의결을 하면 그 법률안은 법률로서 확정된다. 국회의원은 법률이 정하는 직을 겸할 수 없다. 국민경제자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다. 제3항의 승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다. 이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을 얻지 못한 때부터 당연히 효력을 회복한다.</p><p>헌법재판소는 법관의 자격을 가진 9인의 재판관으로 구성하며, 재판관은 대통령이 임명한다. 군사법원의 조직·권한 및 재판관의 자격은 법률로 정한다. 대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를 존중함을 기본으로 한다. 정당은 그 목적·조직과 활동이 민주적이어야 하며, 국민의 정치적 의사형성에 참여하는데 필요한 조직을 가져야 한다. 민주평화통일자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다. 의무교육은 무상으로 한다. 모든 국민은 건강하고 쾌적한 환경에서 생활할 권리를 가지며, 국가와 국민은 환경보전을 위하여 노력하여야 한다. 대통령은 법률에서 구체적으로 범위를 정하여 위임받은 사항과 법률을 집행하기 위하여 필요한 사항에 관하여 대통령령을 발할 수 있다.</p>",
            likes: List(['문완기', '조재원', '김영민']),
            comments: List([
                Map({
                    name: '조재원',
                    comment: "very awesome!!!",
                    recomments: List([])
                }),
                Map({
                    name: '김영민',
                    comment: "거의 노답 수준이네;",
                    recomments: List([])
                })
            ])
        }),
        Map({
            type: 'entertainment',
            title: "시블섹스",
            postedOn: new Date(2015, 11, 28),
            content: "<ul><li>국회에서 의결된 법률안은 정부에 이송되어 15일 이내에 대통령이 공포한다. 국가는 평생교육을 진흥하여야 한다. 국가의 세입·세출의 결산, 국가 및 법률이 정한 단체의 회계검사와 행정기관 및 공무원의 직무에 관한 감찰을 하기 위하여 대통령 소속하에 감사원을 둔다. 정당은 법률이 정하는 바에 의하여 국가의 보호를 받으며, 국가는 법률이 정하는 바에 의하여 정당운영에 필요한 자금을 보조할 수 있다. 법관은 헌법과 법률에 의하여 그 양심에 따라 독립하여 심판한다. 대통령은 취임에 즈음하여 다음의 선서를 한다. 군인 또는 군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상 기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한 경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지 아니한다.</li><li>국회의원은 국회에서 직무상 행한 발언과 표결에 관하여 국회외에서 책임을 지지 아니한다. 공무원인 근로자는 법률이 정하는 자에 한하여 단결권·단체교섭권 및 단체행동권을 가진다. 정당의 설립은 자유이며, 복수정당제는 보장된다. 정당의 목적이나 활동이 민주적 기본질서에 위배될 때에는 정부는 헌법재판소에 그 해산을 제소할 수 있고, 정당은 헌법재판소의 심판에 의하여 해산된다. 농업생산성의 제고와 농지의 합리적인 이용을 위하거나 불가피한 사정으로 발생하는 농지의 임대차와 위탁경영은 법률이 정하는 바에 의하여 인정된다. 모든 국민은 법률이 정하는 바에 의하여 선거권을 가진다.</li><li>모든 국민은 언론·출판의 자유와 집회·결사의 자유를 가진다. 국회가 재적의원 과반수의 찬성으로 계엄의 해제를 요구한 때에는 대통령은 이를 해제하여야 한다. 대통령은 내우·외환·천재·지변 또는 중대한 재정·경제상의 위기에 있어서 국가의 안전보장 또는 공공의 안녕질서를 유지하기 위하여 긴급한 조치가 필요하고 국회의 집회를 기다릴 여유가 없을 때에 한하여 최소한으로 필요한 재정·경제상의 처분을 하거나 이에 관하여 법률의 효력을 가지는 명령을 발할 수 있다. 이 헌법에 의한 최초의 대통령의 임기는 이 헌법시행일로부터 개시한다. 국가는 국민 모두의 생산 및 생활의 기반이 되는 국토의 효율적이고 균형있는 이용·개발과 보전을 위하여 법률이 정하는 바에 의하여 그에 관한 필요한 제한과 의무를 과할 수 있다.</li><li>국무총리는 국회의 동의를 얻어 대통령이 임명한다. 탄핵소추의 의결을 받은 자는 탄핵심판이 있을 때까지 그 권한행사가 정지된다. 모든 국민은 종교의 자유를 가진다. 모든 국민은 사생활의 비밀과 자유를 침해받지 아니한다. 모든 국민은 법률이 정하는 바에 의하여 국방의 의무를 진다. 이 헌법중 공무원의 임기 또는 중임제한에 관한 규정은 이 헌법에 의하여 그 공무원이 최초로 선출 또는 임명된 때로부터 적용한다. 국가는 과학기술의 혁신과 정보 및 인력의 개발을 통하여 국민경제의 발전에 노력하여야 한다. 국회의원의 선거구와 비례대표제 기타 선거에 관한 사항은 법률로 정한다. 모든 국민은 양심의 자유를 가진다.</li><li>사법권은 법관으로 구성된 법원에 속한다. 대통령이 제1항의 기간내에 공포나 재의의 요구를 하지 아니한 때에도 그 법률안은 법률로서 확정된다. 모든 국민은 헌법과 법률이 정한 법관에 의하여 법률에 의한 재판을 받을 권리를 가진다. 법원은 최고법원인 대법원과 각급법원으로 조직된다. 이 헌법시행 당시의 대법원장과 대법원판사가 아닌 법관은 제1항 단서의 규정에 불구하고 이 헌법에 의하여 임명된 것으로 본다. 대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를 존중함을 기본으로 한다. 대법원장과 대법관이 아닌 법관은 대법관회의의 동의를 얻어 대법원장이 임명한다. 국가는 농지에 관하여 경자유전의 원칙이 달성될 수 있도록 노력하여야 하며, 농지의 소작제도는 금지된다.</li></ul>",
            likes: List(['문완기', '박은수', '안효원', '김재민']),
            comments: List([
                Map({
                    name: '박은수',
                    comment: "ㅅㅂㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ",
                    recomments: List([])
                }),
                Map({
                    name: '안효원',
                    comment: "ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ",
                    recomments: List([])
                }),
                Map({
                    name: '김재민',
                    comment: "나는 유린당하고 싶은 사람 ㅇㅇ",
                    recomments: List([])
                }),
                Map({
                    name: '김재민',
                    comment: "나는 원래 재밌는 사람",
                    recomments: List([])
                }),
                Map({
                    name: '김재민',
                    comment: "섹스",
                    recomments: List([])
                })
            ])
        }),
        Map({
            type: 'gamevideo',
            title: "160931 최종 반장전 오라스 극적 '삼배만' 화료···\"문어마장 사상 최고기록\"",
            postedOn: new Date(2016, 5, 3),
            content: "<p>당일&nbsp;최종 반장전의 오-라스</p><p>타가는 각각&nbsp;싱칠(동가), 키다리(남가), 펭귄(서가), 문어(북가)</p><p><br></p><p>도라는 <span style=\"color: rgb(0, 158, 37);\"><span style=\"color: rgb(62, 129, 43);\">6삭</span></span><span style=\"color: rgb(62, 129, 43);\">[六</span><span style=\"font-family: 굴림, gulim, helvetica, sans-serif; color: rgb(62, 129, 43);\"><span style=\"color: rgb(62, 129, 43);\">索</span>]</span></p><p><br></p><p>4순째</p><p>오야인 싱칠 텐파이, 남(南) 버리며&nbsp;리치.</p><p><br></p><p>8순째</p><p>북가인 문어 이샨텐.&nbsp;<span style=\"color: rgb(176, 40, 26);\">3만[三</span><span style=\"color: rgb(176, 40, 26);\">萬</span><span style=\"color: rgb(176, 40, 26);\">]&nbsp;</span>쯔모.</p><p>당시&nbsp;<span style=\"color: rgb(176, 40, 26);\">3만[三</span><span style=\"color: rgb(176, 40, 26);\">萬</span><span style=\"color: rgb(176, 40, 26);\">]</span> 앙꼬를 갖고 있던 그는 안깡을 선언.</p><p>추가&nbsp;도라표시패 확인 결과 <span style=\"color: rgb(176, 40, 26);\">2만[二</span><span style=\"color: rgb(176, 40, 26);\">萬</span><span style=\"color: rgb(176, 40, 26);\">], <span style=\"color: rgb(0, 0, 0);\">즉 깡도라가&nbsp;</span></span><span style=\"color: rgb(176, 40, 26);\">3만[三</span><span style=\"color: rgb(176, 40, 26);\">萬</span><span style=\"color: rgb(176, 40, 26);\">].</span></p><p>깡도라가 본인의&nbsp;깡쯔와&nbsp;걸려맞은 상황 발생&nbsp;(도라4,&nbsp;화료&nbsp;시&nbsp;만관 이상&nbsp;확정)</p><p>마침&nbsp;이때 획득한&nbsp;영상패가 유효패임에 따라&nbsp;8순&nbsp;텐파이(6통-9통 양면팅), 바로&nbsp;리치.</p><p><br></p><p>오야의 빠른 리치에 견제해오던 다른 타가들은&nbsp;갑자기 이와 같이&nbsp;발생한&nbsp;극적 상황에 영향을 받아 견제 대상 변경.</p><p><br></p><p>9순째</p><p>해당 순 내에 문어가 화료한다면 일발까지 붙게 되는 상황에서 하가(펭귄)가 문어의 오름패인&nbsp;6통을 기리</p><p><br></p><p>문어 화료... 리치, 일발, 도라5</p><p><br></p><p>우라도라 확인,&nbsp;<span style=\"color: rgb(176, 40, 26);\">3만[三</span><span style=\"color: rgb(176, 40, 26);\">萬</span><span style=\"color: rgb(176, 40, 26);\">], 5통[五桶]</span></p><p><span style=\"color: rgb(176, 40, 26);\"><br></span></p><p><span style=\"color: rgb(0, 0, 0);\">리치, 일발, 도라9로 11판(삼배만, 24000점)&nbsp;확정</span></p><p><br></p><p><img id=\"se_object_1527909562279\" src=\"http://blogfiles.naver.net/20161001_165/dhksrl2589_1475328954760YQWau_JPEG/KakaoTalk_20161001_025211727.jpg\" class=\"__se_object\" s_type=\"attachment\" s_subtype=\"photo\" style=\"width: 740px; height: 555px; border-color: rgb(0, 0, 0); rwidth:740px; rheight:555px;\" width=\"740\" height=\"555\" imgqe=\"true\" jsonvalue=\"%7B%7D\" rwidth=\"740px\" rheight=\"555px\">&nbsp;</p><p><br></p><p>사실 3인 마작때의&nbsp;국싸무쌍(13판)이 판수상으로는&nbsp;최고기록이나, 4인 마작의 경우 이는&nbsp;최고기록에 해당한다.</p><p><br></p><p><br></p><p>당일, 문어&nbsp;· 키다리&nbsp;·&nbsp;펭귄&nbsp;·&nbsp;아프리칸,&nbsp;그리고 문어마장의&nbsp;VIP이신&nbsp;'싱칠'&nbsp;님께서 자리해주셨다.</p><p><br></p><p><br></p>",
            likes: List([]),
            comments: List([
                
            ])
        })
    ])
}

const ADD_POST = 'contents/ADD_POST';

export const setContentType = createAction(ADD_POST, type => type);

export default handleActions({
    [ADD_POST]: () => {}
}, initialState);

